{
  "complete_narrative": "## Game Story: Scary Place\n\n### Introduction\nYou awake in a dense, misty forest, surrounded by the echoing cries of unknown creatures. Shadows play tricks on your eyes, and the feeling of being watched is omnipresent, yet you see no one. The eerie atmosphere hangs heavy, suffocating in its uncertainty. The theme of 'Scary Place' permeates every inch of this unsettling environment.\n\n### Environment\nA treacherous terrain awaits you. A scattering of small islands nestled in a vast ocean creates a maze of uncertainty. Beware, for the land itself seems against you.\n\n### Quest: Escape the Haunted Woods\n**Description:**  \nSurvive the night and find a way out of the twisted forest filled with lurking dangers. \n\n**Objectives:**\n- Gather resources to survive.\n- Find clues about the forest.\n- Locate a hidden path out.\n\n**Required Entities:**  \n- Map\n- Lantern\n\n**Reward:**  \nFreedom from the haunted woods.\n\n### Interactions\n1. **Chest (Open)**\n   - *Narration:* You creak open the wooden chest, the sound echoing eerily around you.\n   - *Consequence:* You find a mysterious map inside.\n\n2. **Stump (Sit)**\n   - *Narration:* The stump feels damp and cold, sending a shiver down your spine as you rest for a moment.\n   - *Consequence:* You gain a moment to regain your composure.\n\n3. **Campfire (Light)**\n   - *Narration:* A flicker of flame fights against the darkness, casting long, wavering shadows.\n   - *Consequence:* You feel slightly warmer and safer.\n\n4. **Backpack (Wear)**\n   - *Narration:* You sling the backpack over your shoulders, feeling more prepared for the journey ahead.\n   - *Consequence:* You can now carry more items.\n\n5. **Firewood (Collect)**\n   - *Narration:* You scoop up the fallen branches, their brittle texture crackling in your grasp.\n   - *Consequence:* You have gathered resources to possibly kindle a fire.\n\n### Complete Narrative\nIn the heart of this ominous place, your task is to unravel the secrets hidden within the forest and make your escape. As you engage with the environment, each choice you make leads you closer to freedom or deeper into peril. The haunted woods await—will you find your way out, or become another whisper in the trees?",
  "theme": "Scary Place"
}